tests/validation/galinat/template/0/epsilon.oil
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.23e-04;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phi.oil;
        inletValue      uniform 1.23e-04;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.23e-04;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
    }
}


// ************************************************************************* //
